❯ terraform plan
```Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

data.template_file.user_data: Refreshing state...
module.aws_vpc_fedramp.data.aws_vpc_endpoint_service.s3[0]: Refreshing state...
module.aws_vpc_fedramp.data.aws_caller_identity.current: Refreshing state...
module.aws_vpc_fedramp.data.aws_availability_zones.available: Refreshing state...
module.aws_vpc_fedramp.data.aws_region.current: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_autoscaling_attachment.example will be created
  + resource "aws_autoscaling_attachment" "example" {
      + alb_target_group_arn   = (known after apply)
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)
    }

  # aws_autoscaling_group.example will be created
  + resource "aws_autoscaling_group" "example" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = (known after apply)
      + force_delete              = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + launch_configuration      = (known after apply)
      + load_balancers            = (known after apply)
      + max_size                  = 10
      + metrics_granularity       = "1Minute"
      + min_size                  = 2
      + name                      = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + target_group_arns         = (known after apply)
      + vpc_zone_identifier       = (known after apply)
      + wait_for_capacity_timeout = "10m"

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "demo-dev-us-east-1-ec2"
        }
    }

  # aws_launch_configuration.example will be created
  + resource "aws_launch_configuration" "example" {
      + arn                         = (known after apply)
      + associate_public_ip_address = false
      + ebs_optimized               = (known after apply)
      + enable_monitoring           = true
      + id                          = (known after apply)
      + image_id                    = "ami-07d0cf3af28718ef8"
      + instance_type               = "t2.micro"
      + key_name                    = (known after apply)
      + name                        = (known after apply)
      + security_groups             = (known after apply)
      + user_data                   = "6e4944ff70877f06c95f5a5cb194a29940864336"

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_lb.example will be created
  + resource "aws_lb" "example" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = (known after apply)
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags                       = {
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1-lb"
          + "Region"      = "us-east-1"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id = (known after apply)
          + subnet_id     = (known after apply)
        }
    }

  # aws_lb_listener.example will be created
  + resource "aws_lb_listener" "example" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.example will be created
  + resource "aws_lb_target_group" "example" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 300
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = (known after apply)
      + port                               = 8080
      + protocol                           = "HTTP"
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1-lb-target-group"
          + "Region"      = "us-east-1"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = (known after apply)
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = (known after apply)
          + protocol            = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_security_group.load_balancer_port will be created
  + resource "aws_security_group" "load_balancer_port" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "demo-dev-us-east-1-load-balancer-port-sg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1-load-balancer-port-sg"
          + "Region"      = "us-east-1"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.server_port will be created
  + resource "aws_security_group" "server_port" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = "demo-dev-us-east-1-server-port-sg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1-server-port-sg"
          + "Region"      = "us-east-1"
        }
      + vpc_id                 = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_cloudwatch_log_group.vpc_flowlogs[0] will be created
  + resource "aws_cloudwatch_log_group" "vpc_flowlogs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + name              = "demo-dev-us-east-1-vpc-flowlogs"
      + retention_in_days = 0
      + tags              = {
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1-vpc-flowlogs"
          + "Region"      = "us-east-1"
        }
    }

  # module.aws_vpc_fedramp.aws_db_subnet_group.rds_private will be created
  + resource "aws_db_subnet_group" "rds_private" {
      + arn         = (known after apply)
      + description = "Database subnet group for demo-dev-us-east-1"
      + id          = (known after apply)
      + name        = "demo-dev-us-east-1-sng"
      + name_prefix = (known after apply)
      + subnet_ids  = (known after apply)
      + tags        = {
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1-rds-private-subnet-group"
          + "Region"      = "us-east-1"
        }
    }

  # module.aws_vpc_fedramp.aws_eip.nat_gw[0] will be created
  + resource "aws_eip" "nat_gw" {
      + allocation_id     = (known after apply)
      + association_id    = (known after apply)
      + customer_owned_ip = (known after apply)
      + domain            = (known after apply)
      + id                = (known after apply)
      + instance          = (known after apply)
      + network_interface = (known after apply)
      + private_dns       = (known after apply)
      + private_ip        = (known after apply)
      + public_dns        = (known after apply)
      + public_ip         = (known after apply)
      + public_ipv4_pool  = (known after apply)
      + tags              = {
          + "AZ"          = "us-east-1a"
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1a-nat-gw-eip"
          + "Region"      = "us-east-1"
        }
      + vpc               = true
    }

  # module.aws_vpc_fedramp.aws_eip.nat_gw[1] will be created
  + resource "aws_eip" "nat_gw" {
      + allocation_id     = (known after apply)
      + association_id    = (known after apply)
      + customer_owned_ip = (known after apply)
      + domain            = (known after apply)
      + id                = (known after apply)
      + instance          = (known after apply)
      + network_interface = (known after apply)
      + private_dns       = (known after apply)
      + private_ip        = (known after apply)
      + public_dns        = (known after apply)
      + public_ip         = (known after apply)
      + public_ipv4_pool  = (known after apply)
      + tags              = {
          + "AZ"          = "us-east-1b"
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1b-nat-gw-eip"
          + "Region"      = "us-east-1"
        }
      + vpc               = true
    }

  # module.aws_vpc_fedramp.aws_eip.nat_gw[2] will be created
  + resource "aws_eip" "nat_gw" {
      + allocation_id     = (known after apply)
      + association_id    = (known after apply)
      + customer_owned_ip = (known after apply)
      + domain            = (known after apply)
      + id                = (known after apply)
      + instance          = (known after apply)
      + network_interface = (known after apply)
      + private_dns       = (known after apply)
      + private_ip        = (known after apply)
      + public_dns        = (known after apply)
      + public_ip         = (known after apply)
      + public_ipv4_pool  = (known after apply)
      + tags              = {
          + "AZ"          = "us-east-1c"
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1c-nat-gw-eip"
          + "Region"      = "us-east-1"
        }
      + vpc               = true
    }

  # module.aws_vpc_fedramp.aws_flow_log.vpc[0] will be created
  + resource "aws_flow_log" "vpc" {
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_iam_policy.vpc_flowlogs_service[0] will be created
  + resource "aws_iam_policy" "vpc_flowlogs_service" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "demo-dev-us-east-1-vpc-flowlogs-svc-iam-policy"
      + path   = "/demo/dev/us-east-1/"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogGroups",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.aws_vpc_fedramp.aws_iam_role.vpc_flowlogs_service[0] will be created
  + resource "aws_iam_role" "vpc_flowlogs_service" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                      + Sid       = "AllowFlowLogs"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "demo-dev-us-east-1-vpc-flowlogs-svc-iam-role"
      + path                  = "/demo/dev/us-east-1/"
      + tags                  = {
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1-vpc-flowlogs-svc-iam-role"
          + "Region"      = "us-east-1"
        }
      + unique_id             = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_iam_role_policy_attachment.vpc_flowlogs_service[0] will be created
  + resource "aws_iam_role_policy_attachment" "vpc_flowlogs_service" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "demo-dev-us-east-1-vpc-flowlogs-svc-iam-role"
    }

  # module.aws_vpc_fedramp.aws_internet_gateway.this will be created
  + resource "aws_internet_gateway" "this" {
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1-igw"
          + "Region"      = "us-east-1"
        }
      + vpc_id   = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_kms_key.vpc_flowlogs[0] will be created
  + resource "aws_kms_key" "vpc_flowlogs" {
      + arn                      = (known after apply)
      + customer_master_key_spec = "SYMMETRIC_DEFAULT"
      + description              = (known after apply)
      + enable_key_rotation      = true
      + id                       = (known after apply)
      + is_enabled               = true
      + key_id                   = (known after apply)
      + key_usage                = "ENCRYPT_DECRYPT"
      + policy                   = jsonencode(
            {
              + Id        = "key-default-1"
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::078910704546:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:Encrypt*",
                          + "kms:Decrypt*",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Describe*",
                        ]
                      + Condition = {
                          + ArnLike = {
                              + kms:EncryptionContext:aws:logs:arn = "arn:aws:logs:us-east-1:078910704546:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logs.us-east-1.amazonaws.com"
                        }
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags                     = {
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1-vpc-flowlogs-kms-key"
          + "Region"      = "us-east-1"
        }
    }

  # module.aws_vpc_fedramp.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "AZ"          = "us-east-1a"
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1a-nat-gw"
          + "Region"      = "us-east-1"
        }
    }

  # module.aws_vpc_fedramp.aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "AZ"          = "us-east-1b"
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1b-nat-gw"
          + "Region"      = "us-east-1"
        }
    }

  # module.aws_vpc_fedramp.aws_nat_gateway.this[2] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "AZ"          = "us-east-1c"
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1c-nat-gw"
          + "Region"      = "us-east-1"
        }
    }

  # module.aws_vpc_fedramp.aws_network_acl.private will be created
  + resource "aws_network_acl" "private" {
      + egress     = (known after apply)
      + id         = (known after apply)
      + ingress    = (known after apply)
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "demo-dev-us-east-1-private-network-acl"
        }
      + vpc_id     = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_network_acl.public will be created
  + resource "aws_network_acl" "public" {
      + egress     = (known after apply)
      + id         = (known after apply)
      + ingress    = (known after apply)
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "demo-dev-us-east-1-public-network-acl"
        }
      + vpc_id     = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_network_acl_rule.allow_all_from_private_egress will be created
  + resource "aws_network_acl_rule" "allow_all_from_private_egress" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 1
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "6"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 65535
    }

  # module.aws_vpc_fedramp.aws_network_acl_rule.allow_all_public_egress will be created
  + resource "aws_network_acl_rule" "allow_all_public_egress" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 1
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "6"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 65535
    }

  # module.aws_vpc_fedramp.aws_network_acl_rule.allow_all_tcp_internal will be created
  + resource "aws_network_acl_rule" "allow_all_tcp_internal" {
      + cidr_block     = "10.1.0.0/16"
      + egress         = false
      + from_port      = 1
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "6"
      + rule_action    = "allow"
      + rule_number    = 120
      + to_port        = 65535
    }

  # module.aws_vpc_fedramp.aws_network_acl_rule.allow_bastion_ssh_access_public will be created
  + resource "aws_network_acl_rule" "allow_bastion_ssh_access_public" {
      + cidr_block     = "10.1.0.0/16"
      + egress         = false
      + from_port      = 22
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "6"
      + rule_action    = "allow"
      + rule_number    = 210
      + to_port        = 22
    }

  # module.aws_vpc_fedramp.aws_network_acl_rule.allow_http_from_vpc will be created
  + resource "aws_network_acl_rule" "allow_http_from_vpc" {
      + cidr_block     = "10.1.0.0/16"
      + egress         = false
      + from_port      = 80
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "6"
      + rule_action    = "allow"
      + rule_number    = 200
      + to_port        = 80
    }

  # module.aws_vpc_fedramp.aws_network_acl_rule.allow_http_public will be created
  + resource "aws_network_acl_rule" "allow_http_public" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 80
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "6"
      + rule_action    = "allow"
      + rule_number    = 110
      + to_port        = 80
    }

  # module.aws_vpc_fedramp.aws_network_acl_rule.allow_https_public will be created
  + resource "aws_network_acl_rule" "allow_https_public" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 443
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "6"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 443
    }

  # module.aws_vpc_fedramp.aws_network_acl_rule.allow_return_tcp_private will be created
  + resource "aws_network_acl_rule" "allow_return_tcp_private" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "6"
      + rule_action    = "allow"
      + rule_number    = 140
      + to_port        = 65535
    }

  # module.aws_vpc_fedramp.aws_network_acl_rule.allow_return_tcp_public will be created
  + resource "aws_network_acl_rule" "allow_return_tcp_public" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 1024
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "6"
      + rule_action    = "allow"
      + rule_number    = 140
      + to_port        = 65535
    }

  # module.aws_vpc_fedramp.aws_network_acl_rule.allow_ssh_from_bastion_private will be created
  + resource "aws_network_acl_rule" "allow_ssh_from_bastion_private" {
      + cidr_block     = "10.1.0.0/16"
      + egress         = false
      + from_port      = 22
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "6"
      + rule_action    = "allow"
      + rule_number    = 130
      + to_port        = 22
    }

  # module.aws_vpc_fedramp.aws_network_acl_rule.allow_ssh_to_bastion_private[0] will be created
  + resource "aws_network_acl_rule" "allow_ssh_to_bastion_private" {
      + cidr_block     = "10.0.0.0/8"
      + egress         = false
      + from_port      = 22
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "6"
      + rule_action    = "allow"
      + rule_number    = 125
      + to_port        = 22
    }

  # module.aws_vpc_fedramp.aws_route.igw will be created
  + resource "aws_route" "igw" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_route.nat_gw[0] will be created
  + resource "aws_route" "nat_gw" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_route.nat_gw[1] will be created
  + resource "aws_route" "nat_gw" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_route.nat_gw[2] will be created
  + resource "aws_route" "nat_gw" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "AZ"          = "us-east-1a"
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1a-private-rt"
          + "Region"      = "us-east-1"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "AZ"          = "us-east-1b"
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1b-private-rt"
          + "Region"      = "us-east-1"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "AZ"          = "us-east-1c"
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1c-private-rt"
          + "Region"      = "us-east-1"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1-public-rt"
          + "Region"      = "us-east-1"
        }
      + vpc_id           = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_route_table_association.rds_private[0] will be created
  + resource "aws_route_table_association" "rds_private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_route_table_association.rds_private[1] will be created
  + resource "aws_route_table_association" "rds_private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_route_table_association.rds_private[2] will be created
  + resource "aws_route_table_association" "rds_private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_security_group.ssh_from_bastion will be created
  + resource "aws_security_group" "ssh_from_bastion" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "demo-dev-us-east-1-ssh-from-sg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1-ssh-from-bastion-sg"
          + "Region"      = "us-east-1"
        }
      + vpc_id                 = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_security_group.ssh_to_bastion will be created
  + resource "aws_security_group" "ssh_to_bastion" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/8",
                ]
              + description      = ""
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "demo-dev-us-east-1-ssh-to-bastion-sg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1-ssh-to-bastion-sg"
          + "Region"      = "us-east-1"
        }
      + vpc_id                 = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.1.32.0/22"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "AZ"          = "us-east-1a"
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1a-private-subnet"
          + "Region"      = "us-east-1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.1.36.0/22"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "AZ"          = "us-east-1b"
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1b-private-subnet"
          + "Region"      = "us-east-1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.1.40.0/22"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "AZ"          = "us-east-1c"
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1c-private-subnet"
          + "Region"      = "us-east-1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.1.0.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "AZ"          = "us-east-1a"
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1a-public-subnet"
          + "Region"      = "us-east-1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.1.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "AZ"          = "us-east-1b"
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1b-public-subnet"
          + "Region"      = "us-east-1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.1.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "AZ"          = "us-east-1c"
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1c-public-subnet"
          + "Region"      = "us-east-1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_subnet.rds_private[0] will be created
  + resource "aws_subnet" "rds_private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.1.64.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "AZ"          = "us-east-1a"
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1a-rds-private-subnet"
          + "Region"      = "us-east-1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_subnet.rds_private[1] will be created
  + resource "aws_subnet" "rds_private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.1.65.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "AZ"          = "us-east-1b"
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1b-rds-private-subnet"
          + "Region"      = "us-east-1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_subnet.rds_private[2] will be created
  + resource "aws_subnet" "rds_private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.1.66.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "AZ"          = "us-east-1c"
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1c-rds-private-subnet"
          + "Region"      = "us-east-1"
        }
      + vpc_id                          = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_vpc.this will be created
  + resource "aws_vpc" "this" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.1.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1-vpc"
          + "Region"      = "us-east-1"
        }
    }

  # module.aws_vpc_fedramp.aws_vpc_endpoint.s3[0] will be created
  + resource "aws_vpc_endpoint" "s3" {
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-east-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Application" = "demo"
          + "Environment" = "dev"
          + "Name"        = "demo-dev-us-east-1-s3-vpc-endpoint"
          + "Region"      = "us-east-1"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_vpc_endpoint_route_table_association.private_s3[0] will be created
  + resource "aws_vpc_endpoint_route_table_association" "private_s3" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_vpc_endpoint_route_table_association.private_s3[1] will be created
  + resource "aws_vpc_endpoint_route_table_association" "private_s3" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_vpc_endpoint_route_table_association.private_s3[2] will be created
  + resource "aws_vpc_endpoint_route_table_association" "private_s3" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

  # module.aws_vpc_fedramp.aws_vpc_endpoint_route_table_association.public_s3[0] will be created
  + resource "aws_vpc_endpoint_route_table_association" "public_s3" {
      + id              = (known after apply)
      + route_table_id  = (known after apply)
      + vpc_endpoint_id = (known after apply)
    }

Plan: 69 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------
```